emacs/emacs-basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Basic Key Bindings Of Emacs</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/website/css/default.css' />
<link rel='stylesheet' href='/website/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">
<h1 id='site-name'>Bryan Rinders</h1>
<div id='menu'>
  <a href='/website/'>Home</a>
  <a href='/website/ctf-index.html'>CTF WriteUps</a>
  <a href='/website/emacs-index.html'>Emacs</a>
  <a href='/website/linux-index.html'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
  <a href='/website/other-index.html'>Other</a>
  <span class='right'>
    <a href='/website/sitemap.html'>Sitemap</a>
  </span>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">The Basic Key Bindings Of Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1204202">1. Buffer movement</a></li>
<li><a href="#org790def2">2. Cursor movement</a></li>
<li><a href="#orgd1384be">3. Universal argument</a></li>
<li><a href="#org99d95c6">4. Quit</a></li>
<li><a href="#orge9b92e2">5. Windows</a></li>
<li><a href="#org4ee2986">6. Editing</a></li>
<li><a href="#org3c5c889">7. Files</a></li>
<li><a href="#orgc34f262">8. Buffers</a></li>
<li><a href="#org4595222">9. Searching</a></li>
<li><a href="#orgded4607">10. </a></li>
</ul>
</div>
</div>
<p>
The most important key binding is <code>M-x</code>; to get access to all of
Emacs' commands.
</p>

<div id="outline-container-org1204202" class="outline-2">
<h2 id="org1204202"><span class="section-number-2">1</span> Buffer movement</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-v</td>
<td class="org-left">scroll-up-command</td>
<td class="org-left">Scroll the window up a full screen</td>
</tr>

<tr>
<td class="org-left">M-v</td>
<td class="org-left">scroll-down-command</td>
<td class="org-left">Scroll the window down a full window</td>
</tr>

<tr>
<td class="org-left">C-l</td>
<td class="org-left">recenter-top-bottom</td>
<td class="org-left">Center the buffer around the cursor</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org790def2" class="outline-2">
<h2 id="org790def2"><span class="section-number-2">2</span> Cursor movement</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-f</td>
<td class="org-left">forward-char</td>
<td class="org-left">Move the cursor forward one character</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">backward-char</td>
<td class="org-left">Move the cursor backward one character</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">previous-line</td>
<td class="org-left">Move the cursor to the previous line</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">next-line</td>
<td class="org-left">Move the cursor to the next line</td>
</tr>

<tr>
<td class="org-left">M-f</td>
<td class="org-left">forward-word</td>
<td class="org-left">Move the cursor forward one word</td>
</tr>

<tr>
<td class="org-left">M-b</td>
<td class="org-left">backward-word</td>
<td class="org-left">Move the cursor backward one word</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-a</td>
<td class="org-left">move-beginning-of-line</td>
<td class="org-left">Move the cursor to the beginning of the line</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">move-end-of-line</td>
<td class="org-left">Move the cursor to the end of the line</td>
</tr>

<tr>
<td class="org-left">M-a</td>
<td class="org-left">backward-sentence</td>
<td class="org-left">Move the cursor backwards one sentence</td>
</tr>

<tr>
<td class="org-left">M-e</td>
<td class="org-left">forward-sentence</td>
<td class="org-left">Move the cursor forwards one sentence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">beginning-of-buffer</td>
<td class="org-left">Move to the beginning of the buffer</td>
</tr>

<tr>
<td class="org-left">M-&gt;</td>
<td class="org-left">end-of-buffer</td>
<td class="org-left">Move to the end of the buffer</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd1384be" class="outline-2">
<h2 id="orgd1384be"><span class="section-number-2">3</span> Universal argument</h2>
<div class="outline-text-2" id="text-3">
<p>
To supply an emacs command a numeric argument, the repeat count or
prefix argument, prefix it with <code>C-u</code> and then the digits before you
type the command. Alternatively hold Meta will typing the digits. For
example <code>C-u 15 C-f</code> moves the cursor 15 characters forward. Negative
are also possible e.g. <code>C-u -15 C-f</code> to move backwards 15 characters.
</p>

<p>
The universal argument also work on regular characters, e.g. <code>C-u 8 *</code>
results in <code>********</code>.
</p>
</div>
</div>

<div id="outline-container-org99d95c6" class="outline-2">
<h2 id="org99d95c6"><span class="section-number-2">4</span> Quit</h2>
<div class="outline-text-2" id="text-4">
<p>
To quit in the middle of typing a key cord use <code>C-g</code>. It can also be
used when Emacs stops responding.
</p>
</div>
</div>

<div id="outline-container-orge9b92e2" class="outline-2">
<h2 id="orge9b92e2"><span class="section-number-2">5</span> Windows</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x 1</td>
<td class="org-left">delete-other-windows</td>
<td class="org-left">delete all windows except the focussed window</td>
</tr>

<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">split-window-below</td>
<td class="org-left">Create a new window below</td>
</tr>

<tr>
<td class="org-left">C-x 3</td>
<td class="org-left">split-window-right</td>
<td class="org-left">Create a new window to the right</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4ee2986" class="outline-2">
<h2 id="org4ee2986"><span class="section-number-2">6</span> Editing</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgfc6f180" class="outline-3">
<h3 id="orgfc6f180"><span class="section-number-3">6.1</span> Killing, Deleting and Yanking</h3>
<div class="outline-text-3" id="text-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;DEL&gt;</td>
<td class="org-left">kill-backward-char</td>
<td class="org-left">&lt;DEL&gt; := backspace</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">delete-char</td>
<td class="org-left">delete character under the cursor</td>
</tr>

<tr>
<td class="org-left">M-&lt;DEL&gt;</td>
<td class="org-left">backward-kill-word</td>
<td class="org-left">kill the word before the cursor</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">kill-word</td>
<td class="org-left">kill the word after the cursor</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">kill-line</td>
<td class="org-left">kill the line after the cursor</td>
</tr>

<tr>
<td class="org-left">M-k</td>
<td class="org-left">kill-sentence</td>
<td class="org-left">kill the sentence after the cursor</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-w</td>
<td class="org-left">kill-region</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">yank</td>
<td class="org-left">'paste' text from the kill ring</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">yank-pop</td>
<td class="org-left">search the kill ring by repeatedly pressing <code>M-y</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd195b19" class="outline-3">
<h3 id="orgd195b19"><span class="section-number-3">6.2</span> Undo-ing</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<code>C-/</code>, <code>C-_</code> and <code>C-x u</code> can be used to undo. In order to redo
(i.e. undo your undos) you must 'push' your undos to the
undo-ring. You do this by pressing <code>C-g</code> (or any movement such as
<code>C-f</code>) and then use <code>C-/</code> (or one of the other undo commands) to undo
your undos.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Key binding</td>
<td class="org-left">Function</td>
<td class="org-left">Notes</td>
</tr>

<tr>
<td class="org-left">C-/, C-_, C-x u</td>
<td class="org-left">undo</td>
<td class="org-left">undo any edit</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3c5c889" class="outline-2">
<h2 id="org3c5c889"><span class="section-number-2">7</span> Files</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">find-file</td>
<td class="org-left">open a file for editing</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">save-buffer</td>
<td class="org-left">save the file</td>
</tr>
</tbody>
</table>

<p>
Note that the file (and the directory it lives in) opened with <code>C-x
C-f</code> does not need to exist. Once you save the file, <code>C-x C-s</code> Emacs
will create the file and directories if necessary.
</p>
</div>
</div>

<div id="outline-container-orgc34f262" class="outline-2">
<h2 id="orgc34f262"><span class="section-number-2">8</span> Buffers</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">list-buffers</td>
<td class="org-left">open a buffer listing all buffers</td>
</tr>

<tr>
<td class="org-left">C-x b</td>
<td class="org-left">switch-to-buffer</td>
<td class="org-left">switch to a buffer</td>
</tr>

<tr>
<td class="org-left">C-x s</td>
<td class="org-left">save-some-buffers</td>
<td class="org-left">interactively save open buffers</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4595222" class="outline-2">
<h2 id="org4595222"><span class="section-number-2">9</span> Searching</h2>
</div>

<div id="outline-container-orgded4607" class="outline-2">
<h2 id="orgded4607"><span class="section-number-2">10</span> </h2>
<div class="outline-text-2" id="text-10">
<p>
Tutorial line 869
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2023 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>/<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
